<?php // https://t.me/seoyam
$GLOBAL["log"] = "0"; // Вести лог
$GLOBAL["template"] = "2"; // 0 - шаблон simple. 1 - разноцветные шаблоны. 2 - черно-белые шаблоны. 3 - отдельный шаблон
$GLOBAL["template_dir"] = __DIR__."/../php/"; // Каталог отдельного шаблона
$GLOBAL["language"] = "en"; // язык
$GLOBAL["pack_scheme"] = "https"; // http или https у доменов в пачке
$GLOBAL["sub_mode"] = "0"; // 0 - субдомены генерируются случайно. 1 - субдомены берутся из файла sub.txt
$GLOBAL["page_mode"] = "0"; // 0 - названия страниц генерируются случайно. 1 - названия страниц ЧПУ
$GLOBAL["title_host"] = "0"; // 0 - не добавлять хост в title. 1 - добавлять хост в title
$GLOBAL["sitemap_count"] = 50000; // Максимальное количество страниц в sitemap.xml
$GLOBAL["internal_link"] = "1"; // 0 - не использовать внутреннюю перелинковку, 1 - использовать внутреннюю перелинковку
$GLOBAL["external_link"] = "0"; // 0 - не использовать внешнюю перелинковку, 1 - использовать внешнюю перелинковку
$GLOBAL["generate"] = "1"; // 0 - не использовать генерированный контент, 1 - использовать генерированный контент
// Настройки контента
$GLOBAL["list_on"] = "1"; // Использовать списки ul, ol, dl
$GLOBAL["blockquote_on"] = "1"; // Использовать blockquote
$GLOBAL["pre_on"] = "1"; // Использовать pre
$GLOBAL["table_on"] = "1"; // Использовать таблицы
$GLOBAL["image_on"] = "1"; // Использовать изображения
// https://t.me/seoyam
?>
